In [1]:
import mysql.connector

In [2]:
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password=""
)
print(mydb)
mycursor=mydb.cursor(buffered=True)

<mysql.connector.connection.MySQLConnection object at 0x00000227A8252D30>

In [5]:
mycursor.execute("CREATE DATABASE school_new")

In [14]:
mycursor.execute("Use school_new")

In [11]:
mycursor.execute("CREATE TABLE student(student_id INT PRIMARY KEY,student_name VARCHAR(40),aadhar_number INT(12),father_name VARCHAR(40),mother_name VARCHAR(40),mobile INT(10) NOT NULL,Class INT(3) NOT NULL,section VARCHAR(3) NOT NULL)")

In [31]:
mycursor.execute("ALTER TABLE student_details CHANGE COLUMN mobile mobile INT ")

In [12]:
mydb.commit()

In [82]:
mycursor.execute("CREATE TABLE total_marks(student_id INT,Quaterly INT,Halfyearly INT,Annual INT,FOREIGN KEY(student_id) REFERENCES student_details(student_id) ON DELETE CASCADE)")

In [83]:
mydb.commit()

In [20]:
mycursor.execute("CREATE TABLE quaterly_marks(student_id INT,maths INT ,science INT,social INT,english INT,FOREIGN KEY(student_id) REFERENCES student(student_id) ON DELETE CASCADE)")

In [24]:

mycursor.execute("CREATE TABLE halfyearly_marks(student_id INT,maths INT ,science INT,social INT,english INT,total INT,result VARCHAR(4),FOREIGN KEY(student_id) REFERENCES student(student_id) ON DELETE CASCADE)")

In [25]:

mycursor.execute("CREATE TABLE annual_marks(student_id INT,maths INT ,science INT,social INT,english INT,total INT,result VARCHAR(4),FOREIGN KEY(student_id) REFERENCES student(student_id) ON DELETE CASCADE)")

In [53]:
mycursor.execute("ALTER TABLE quaterly_marks ADD(total INT ,result VARCHAR(4)) ")

In [26]:
mycursor.execute("RENAME TABLE student TO student_details")

In [46]:
mydb.commit()

In [69]:
mycursor.execute("INSERT INTO student_details VALUES(501,'Sainik','654268956542','Veernayak','Roshini','9564826548',5,'A')")
mycursor.execute("INSERT INTO student_details VALUES(502,'Ranvesh','856426987552','Ramesh','Tejapriya','8547625695',5,'A')")
mycursor.execute("INSERT INTO student_details VALUES(503,'Kashi','845165987568','Shivaji','Vimala','9785426845',5,'B')")
mycursor.execute("INSERT INTO student_details VALUES(504,'Shogun','584269874521','Rampratap','Swarna','9542631858',5,'B')")
mycursor.execute("INSERT INTO student_details VALUES(505,'Komal','685236478952','Valmiki','Damyanthi','7236548952',5,'A')")
mydb.commit()

In [70]:
mycursor.execute("INSERT INTO quaterly_marks VALUES(501,54,85,65,95,NULL,NULL)")
mycursor.execute("INSERT INTO quaterly_marks VALUES(502,94,56,85,42,NULL,NULL)")
mycursor.execute("INSERT INTO quaterly_marks VALUES(503,54,65,32,78,NULL,NULL)")
mycursor.execute("INSERT INTO quaterly_marks VALUES(504,78,65,94,85,NULL,NULL)")
mycursor.execute("INSERT INTO quaterly_marks VALUES(505,30,45,99,95,NULL,NULL)")
mydb.commit()

In [71]:
mycursor.execute("UPDATE quaterly_marks SET total=maths+science+social+english")
mycursor.execute("UPDATE quaterly_marks SET result='pass' WHERE maths>=35 and science>=35 and social>=35 and english>=35")
mycursor.execute("UPDATE quaterly_marks SET result='fail' WHERE maths<35 or science<35 or social<35 or english<35")
mydb.commit()

In [72]:
mycursor.execute("INSERT INTO halfyearly_marks VALUES(501,75,95,62,42,NULL,NULL)")
mycursor.execute("INSERT INTO halfyearly_marks VALUES(502,53,64,98,75,NULL,NULL)")
mycursor.execute("INSERT INTO halfyearly_marks VALUES(503,88,86,84,94,NULL,NULL)")
mycursor.execute("INSERT INTO halfyearly_marks VALUES(504,75,32,28,48,NULL,NULL)")
mycursor.execute("INSERT INTO halfyearly_marks VALUES(505,84,95,62,26,NULL,NULL)")
mydb.commit()

In [73]:
mycursor.execute("UPDATE halfyearly_marks SET total=maths+science+social+english")
mycursor.execute("UPDATE halfyearly_marks SET result='pass' WHERE maths>=35 and science>=35 and social>=35 and english>=35")

mycursor.execute("UPDATE halfyearly_marks SET result='fail' WHERE maths<35 or science<35 or social<35 or english<35")
mydb.commit()

In [74]:
mycursor.execute("INSERT INTO annual_marks VALUES(501,54,87,65,95,NULL,NULL)")
mycursor.execute("INSERT INTO annual_marks VALUES(502,92,56,20,42,NULL,NULL)")
mycursor.execute("INSERT INTO annual_marks VALUES(503,59,65,52,78,NULL,NULL)")
mycursor.execute("INSERT INTO annual_marks VALUES(504,78,65,94,84,NULL,NULL)")
mycursor.execute("INSERT INTO annual_marks VALUES(505,54,85,95,57,NULL,NULL)")
mydb.commit()

In [75]:
mycursor.execute("UPDATE annual_marks SET total=maths+science+social+english")
mycursor.execute("UPDATE annual_marks SET result='pass' WHERE maths>=35 and science>=35 and social>=35 and english>=35")
mycursor.execute("UPDATE annual_marks SET result='fail' WHERE maths<35 or science<35 or social<35 or english<35")
mydb.commit()

In [84]:
mycursor.execute("INSERT INTO total_marks VALUES(501,299,274,301)")
mycursor.execute("INSERT INTO total_marks VALUES(502,277,290,210)")
mycursor.execute("INSERT INTO total_marks VALUES(503,229,352,254)")
mycursor.execute("INSERT INTO total_marks VALUES(504,322,183,321)")
mycursor.execute("INSERT INTO total_marks VALUES(505,269,267,291)")
mydb.commit()

In [15]:
mycursor.execute("INSERT INTO students VALUES(501,'Sainik',5,'A','paid')")
mycursor.execute("INSERT INTO students VALUES(502,'Ranvesh',5,'A','notpaid')")
mycursor.execute("INSERT INTO students VALUES(503,'Kashi',5,'B','paid')")
mycursor.execute("INSERT INTO students VALUES(504,'Shogun',5,'B','paid')")
mycursor.execute("INSERT INTO students VALUES(505,'Komal',5,'A','notpaid')")

mydb.commit()

In [ ]:
#All the stored procedures for module 1 in MYSQL are :
Procedure:admin_add


BEGIN
 INSERT INTO student_details(student_id,student_name,aadhar_number,father_name,mother_name,mobile,Class,section)VALUES (stid,sname,adhar,sfathname,smothname,mob,uclass,usec);

END

--------------------------------------------------------------------------------
Procedure:admin_delete

BEGIN
DELETE FROM student_details
WHERE student_id=studId;
 
END

---------------------------------------------------------------------------------
Prcedure:admin_update

BEGIN
UPDATE student_details
SET student_name = sname,aadhar_number=adhar,father_name=father,mother_name=mother,mobile=mob,Class=uclass,section=usection
WHERE student_id = studId;

END

-----------------------------------------------------------------------------------
Procedure:admin_view

BEGIN
SELECT * FROM student_details WHERE student_id=stid;

END

In [ ]:
#All Stored procedures for module2 are:

teach_entry_quater:

BEGIN

INSERT INTO quaterly_marks(student_id,maths,science,social,english,total,result)VALUES(studId,math,sci,soc,eng,utotal,res);

END

-----------------------------------------------------------
teach_entry_halfyearly

BEGIN

INSERT INTO halfyearly_marks(student_id,maths,science,social,english,total,result)VALUES(studId,math,sci,soc,eng,utotal,res);

END

----------------------------------------------------------------
teacher_entry_annual



BEGIN

INSERT INTO annual_marks(student_id,maths,science,social,english,total,result)VALUES(studId,math,sci,soc,eng,utotal,res);

END

-----------------------------------------------------------------
filter_fail_maths

BEGIN

SELECT student_details.student_id,student_details.student_name
FROM student_details
WHERE student_details.student_id IN(
    SELECT quaterly_marks.student_id
    FROM quaterly_marks
    WHERE quaterly_marks.maths <35
    UNION
    SELECT halfyearly_marks.student_id
    FROM halfyearly_marks
    WHERE halfyearly_marks.maths <35
    UNION
    SELECT annual_marks.student_id
    FROM annual_marks
    WHERE annual_marks.maths <35

);

END

----------------------------------------------------------------------
filter_fail_science

BEGIN
SELECT student_details.student_id,student_details.student_name
FROM student_details
WHERE student_details.student_id IN(
    SELECT quaterly_marks.student_id
    FROM quaterly_marks
    WHERE quaterly_marks.science <35
    UNION
    SELECT halfyearly_marks.student_id
    FROM halfyearly_marks
    WHERE halfyearly_marks.science <35
    UNION
    SELECT annual_marks.student_id
    FROM annual_marks
    WHERE annual_marks.science <35

);


END

----------------------------------------------------------------------
filter_fail_social

BEGIN
SELECT student_details.student_id,student_details.student_name
FROM student_details
WHERE student_details.student_id IN(
    SELECT quaterly_marks.student_id
    FROM quaterly_marks
    WHERE quaterly_marks.social <35
    UNION
    SELECT halfyearly_marks.student_id
    FROM halfyearly_marks
    WHERE halfyearly_marks.social <35
    UNION
    SELECT annual_marks.student_id
    FROM annual_marks
    WHERE annual_marks.social <35

);
END

------------------------------------------------------------------
filter_fail_english

BEGIN
SELECT student_details.student_id,student_details.student_name
FROM student_details
WHERE student_details.student_id IN(
    SELECT quaterly_marks.student_id
    FROM quaterly_marks
    WHERE quaterly_marks.english <35
    UNION
    SELECT halfyearly_marks.student_id
    FROM halfyearly_marks
    WHERE halfyearly_marks.english <35
    UNION
    SELECT annual_marks.student_id
    FROM annual_marks
    WHERE annual_marks.english <35

);
END

In [4]:
mycursor.execute("USE school_new")

In [5]:
#Calling stored procedure admin_view


mycursor.callproc('admin_view',[input(),])

for result in mycursor.stored_results():
    rlist=result.fetchall()
    for row in rlist:
        print(row)

502
(502, 'Ranvesh', '856426987552', 'Ramesh', 'Tejapriya', '8547625695', 5, 'A')

In [14]:
#calling stored procedure admin_update


mycursor.callproc('admin_update',[input("studentId: "),input("studentname: "),input("Aadhar: "),input("Father: "),input("Mother: "),input("Mobile: "),input("Class: "),input("Section: "),])

print("updated succesfully")

mydb.commit()

studentId: 507
studentname: Sanath
Aadhar: 856425658
Father: Devender
Mother: fathima
Mobile: 95684256
Class: 5
Section: A
updated succesfully

In [15]:
#calling procedure admin_add

mycursor.callproc('admin_add',[input("studentId: "),input("studentname: "),input("Aadhar: "),input("Father: "),input("Mother: "),input("Mobile: "),input("Class: "),input("Section: "),])

print("Added succesfully.")

mydb.commit()

studentId: 506
studentname: Anurag
Aadhar: 95864526
Father: Sreekar
Mother: Kanika
Mobile: 98565452
Class: 5
Section: D
Added succesfully.

In [13]:
#calling procedure admin_delete

mycursor.callproc('admin_delete',[input("studentId to be deleted: "),])
print("Deleted succesfully.")

mydb.commit()

studentId to be deleted: 506
Deleted succesfully.

In [17]:
#Calling stored procedure to enter quaterly marks using student_id

mycursor.callproc('teach_entry_quater',[input("studentId: "),input("Maths: "),input("Science: "),input("Social: "),input("English: "),input("Total: "),input("Result: "),])

print("Marks added succesfully.")

mydb.commit()

studentId: 506
Maths: 80
Science: 90
Social: 40
English: 60
Total: 270
Result: Pass
Marks added succesfully.

In [18]:
#Calling stored procedure to enter halfyearly marks using student_id

mycursor.callproc('teach_entry_halfyearly',[input("studentId: "),input("Maths: "),input("Science: "),input("Social: "),input("English: "),input("Total: "),input("Result: "),])

print("Marks added succesfully.")

mydb.commit()

studentId: 506
Maths: 60
Science: 55
Social: 35
English: 90
Total: 240
Result: Pass
Marks added succesfully.

In [20]:
#Calling stored procedure to enter annual marks using student_id

mycursor.callproc('teacher_entry_annual',[input("studentId: "),input("Maths: "),input("Science: "),input("Social: "),input("English: "),input("Total: "),input("Result: "),])

print("Marks added succesfully.")

mydb.commit()

studentId: 506
Maths: 56
Science: 84
Social: 66
English: 54
Total: 260
Result: Pass
Marks added succesfully.

In [21]:
#Filtering students failed in MATHS subject in all exams 

mycursor.callproc('filter_fail_maths',)
for result in mycursor.stored_results():
    rlist=result.fetchall()
    for row in rlist:
        print(row)

(505, 'Komal')

In [22]:
#Filtering students failed in SCIENCE subject in all exams 

mycursor.callproc('filter_fail_science',)
for result in mycursor.stored_results():
    rlist=result.fetchall()
    for row in rlist:
        print(row)

(504, 'Shogun')

In [25]:
#Filtering students failed in SOCIAL subject in all exams 

mycursor.callproc('filter_fail_social',)
for result in mycursor.stored_results():
    rlist=result.fetchall()
    for row in rlist:
        print(row)

(502, 'Ranvesh')
(503, 'Kashi')
(504, 'Shogun')

In [26]:
#Filtering students failed in ENGLISH subject in all exams 

mycursor.callproc('filter_fail_english',)
for result in mycursor.stored_results():
    rlist=result.fetchall()
    for row in rlist:
        print(row)

(505, 'Komal')